========================================
str_double_quotes: raw
========================================

foo=\033

---

(file
  (environment_assignment
    (name)
    (value
      (backslash_escape))))

========================================
str_double_quotes: single quotes
========================================

foo='"'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes))))

========================================
str_double_quotes: double quotes
========================================

foo="\\u09aF\\u0123abCD\\777\\\a"

---

(file
  (environment_assignment
    (name)
    (value
      (str_double_quotes
        (backslash_escape)
        (backslash_escape)
        (backslash_escape)
        (backslash_escape)
        (backslash_escape)))))

========================================
str_double_quotes: mixed
========================================

foo=\033'1'"2"

---

(file
  (environment_assignment
    (name)
    (value
      (backslash_escape)
      (str_single_quotes)
      (str_double_quotes))))

========================================
str_double_quotes: multi line
========================================

foo="a\
b\
c"

---

(file
  (environment_assignment
    (name)
    (value
      (str_double_quotes))))

========================================
str_double_quotes: variable
========================================

foo='#S#{var}'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes
        (expr_single_quotes
          (variable_name_short))
        (expr_single_quotes
          (variable_name))))))

========================================
str_double_quotes: status
========================================

foo='#[bold,fg=#000000,italic]'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes
        (expr_single_quotes
          (attribute)
          (attribute)
          (attribute))))))

========================================
str_double_quotes: shell command
========================================

foo='#(ls)'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes
        (expr_single_quotes
          (shell))))))

========================================
str_double_quotes: shell command args
========================================

foo='#(date --debug +%Y-%m-%d)'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes
        (expr_single_quotes
          (shell))))))

========================================
str_double_quotes: comparison
========================================

foo='#{==:#{var1}#{var2},#{var3}}'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes
        (expr_single_quotes
          (operator)
          (expr_single_quotes
            (variable_name))
          (expr_single_quotes
            (variable_name))
          (expr_single_quotes
            (variable_name)))))))

========================================
str_double_quotes: comparison empty else
========================================

foo='#{==:#{var},}'

---

(file
  (environment_assignment
    (name)
    (value
      (str_single_quotes
        (expr_single_quotes
          (operator)
          (expr_single_quotes
            (variable_name)))))))

========================================
str_double_quotes: ternary
========================================

foo="#{?var1,#{var1},#{var2}}"

---

(file
  (environment_assignment
    (name)
    (value
      (str_double_quotes
        (expr_double_quotes
          (variable_name)
          (expr_double_quotes
            (variable_name))
          (expr_double_quotes
            (variable_name)))))))

========================================
str_double_quotes: ternary empty if
========================================

foo="#{?var1,,#{var2}}"

---

(file
  (environment_assignment
    (name)
    (value
      (str_double_quotes
        (expr_double_quotes
          (variable_name)
          (expr_double_quotes
            (variable_name)))))))

========================================
str_double_quotes: ternary empty else
========================================

foo="#{?var1,#{var2},}"

---

(file
  (environment_assignment
    (name)
    (value
      (str_double_quotes
        (expr_double_quotes
          (variable_name)
          (expr_double_quotes
            (variable_name)))))))

========================================
str_double_quotes: condition nested
========================================

foo="#{?#{==:#{var1},},a#{var2},b#[bold,italic]}"

---

(file
  (environment_assignment
    (name)
    (value
      (str_double_quotes
        (expr_double_quotes
          (expr_double_quotes
            (operator)
            (expr_double_quotes
              (variable_name)))
          (expr_double_quotes
            (variable_name))
          (expr_double_quotes
            (attribute)
            (attribute)))))))
